def inputCalculations(inp):
    c = 0
    nums = []
    for elem in inp:
        if type(strtoint[elem]) == int:
            c += strtoint[elem]
        else:
            nums.append(c)
            nums.append(strtoint[elem])
            c = 0
    nums.append(c)
    for i in range(0,len(nums)-2,3):
        firstop = nums[i]
        secondop = nums[i+2]
        if nums[i + 1] == "+":
            res = firstop + secondop
        elif nums[i + 1] == "-":
            res = firstop - secondop
        elif nums[i + 1] == "*":
            res = firstop * secondop
    return res
def printCalculations(res):
    resbybit = []
    if res >= 0 and res <= 19:
        print(inttostr[res])
    else:
        res = str(res)
        i = len(res)
        for elem in res:
            resbybit.append(int(elem) * 10 ** (i-1))
            i -= 1
        if resbybit[-2] == 10:
            resbybit[-2] = resbybit[-2] + resbybit[-1]
            resbybit.pop()
        for elem in resbybit:
            if elem != 0:
                print(inttostr[elem] , end = " ")
strtoint = {"ноль": 0,
            "один": 1,
            "два": 2,
            "три": 3,
            "четыре": 4,
            "пять": 5,
            "шесть": 6,
            "семь": 7,
            "восемь": 8,
            "девять": 9,
            "десять": 10,
            "одиннадцать": 11,
            "двенадцать": 12,
            "тринадцать": 13,
            "четырнадцать": 14,
            "пятнадцать": 15,
            "шестнадцать": 16,
            "семнадцать": 17,
            "восемнадцать": 18,
            "девятнадцать": 19,
            "двадцать": 20,
            "тридцать": 30,
            "сорок": 40,
            "пятьдесят": 50,
            "шестьдесят": 60,
            "семьдесят": 70,
            "восемьдесят": 80,
            "девяносто": 90,
            "сто": 100,
            "двести": 200,
            "триста": 300,
            "четыреста": 400,
            "пятьсот": 500,
            "шестьсот": 600,
            "семьсот": 700,
            "восемьсот": 800,
            "девятьсот": 900,
            "тысяча": 1000,
            "плюс": "+",
            "минус": "-",
            "умножить": "*",
            }
inttostr = {0: "ноль",
            1: "один",
            2: "два",
            3: "три",
            4: "четыре",
            5: "пять",
            6: "шесть",
            7: "семь",
            8: "восемь",
            9: "девять",
            10: "десять",
            11: "одиннадцать",
            12: "двенадцать",
            13: "тринадцать",
            14: "четырнадцать",
            15: "пятнадцать",
            16: "шестнадцать",
            17: "семнадцать",
            18: "восемнадцать",
            19: "девятнадцать",
            20: "двадцать",
            30: "тридцать",
            40: "сорок",
            50: "пятьдесят",
            60: "шестьдесят",
            70: "семьдесят",
            80: "восемьдесят",
            90: "девяносто",
            100: "сто",
            200: "двести",
            300: "триста",
            400: "четыреста",
            500: "пятьсот",
            600: "шестьсот",
            700: "семьсот",
            800: "восемьсот",
            900: "девятьсот",
            1000: "тысяча",
            "+": "плюс",
            "-": "минус",
            "*": "умножить",}

def main():
    inp = input().split()
    res = inputCalculations(inp)
    printCalculations(res)

main()
# пятьдесят два плюс три